---
kind: other
id: Properties.T:Autodesk.Revit.DB.RuledSurface
source: html/5130f65b-8044-0e32-2022-27a122a9c0ea.htm
---
# RuledSurface Properties

Specifies whether the .NET object represents a valid Revit entity.